# @Time : 2020/12/19 14:13
#coding:utf-8


if __name__ == '__main__':


    list = ['肖申克的救赎', '霸王别姬', '阿甘正传', '这个杀手不太冷', '泰坦尼克号', '美丽人生', '千与千寻', '辛德勒的名单', '盗梦空间', '忠犬八公的故事', '星际穿越', '海上钢琴师', '楚门的世界', '三傻大闹宝莱坞', '机器人总动员', '放牛班的春天', '大话西游之大圣娶亲', '熔炉', '疯狂动物城', '无间道', '教父', '龙猫', '当幸福来敲门', '怦然心动', '触不可及', '控方证人', '蝙蝠侠：黑暗骑士', '活着', '末代皇帝', '寻梦环游记', '乱世佳人', '何以为家', '指环王3：王者无敌', '摔跤吧！爸爸', '飞屋环游记', '少年派的奇幻漂流', '哈利·波特与魔法石', '十二怒汉', '素媛', '哈尔的移动城堡', '鬼子来了', '天空之城', '大话西游之月光宝盒', '我不是药神', '闻香识女人', '罗马假日', '天堂电影院', '辩护人', '搏击俱乐部', '猫鼠游戏', '大闹天宫', '教父2', '狮子王', '指环王2：双塔奇兵', '死亡诗社', '钢琴家', '黑客帝国', '指环王1：魔戒再现', '窃听风暴', '饮食男女', '美丽心灵', '两杆大烟枪', '让子弹飞', '绿皮书', '本杰明·巴顿奇事', '飞越疯人院', '看不见的客人', '海蒂和爷爷', '西西里的美丽传说', '拯救大兵瑞恩', '小鞋子', '穿条纹睡衣的男孩', '情书', '音乐之声', '海豚湾', '美国往事', '致命魔术', '沉默的羔羊', '低俗小说', '禁闭岛', '蝴蝶效应', '七宗罪', '心灵捕手', '布达佩斯大饭店', '春光乍泄', '被嫌弃的松子的一生', '摩登时代', '阿凡达', '哈利·波特与死亡圣器(下)', '喜剧之王', '剪刀手爱德华', '勇敢的心', '致命ID', '加勒比海盗', '杀人回忆', '狩猎', '天使爱美丽', '断背山', '请以你的名字呼唤我', '7号房的礼物', '红辣椒', '幽灵公主', '小森林 夏秋篇', '阳光灿烂的日子', '第六感', '重庆森林', '入殓师', '小森林 冬春篇', '唐伯虎点秋香', '爱在黎明破晓前', '消失的爱人', '一一', '蝙蝠侠：黑暗骑士崛起', '菊次郎的夏天', '超脱', '侧耳倾听', '倩女幽魂', '无人知晓', '超能陆战队', '甜蜜蜜', '萤火之森', '玛丽和马克思', '功夫', '借东西的小人阿莉埃蒂', '驯龙高手', '人生果实', '告白', '爱在日落黄昏时', '大鱼', '幸福终点站', '阳光姐妹淘', '完美的世界', '射雕英雄传之东成西就', '恐怖直播', '哈利·波特与阿兹卡班的囚徒', '天书奇谭', '怪兽电力公司', '神偷奶爸', '玩具总动员3', '傲慢与偏见', '时空恋旅人', '教父3', '血战钢锯岭', '釜山行', '哈利·波特与密室', '哪吒闹海', '风之谷', '被解救的姜戈', '电锯惊魂', '喜宴', '七武士', '一个叫欧维的男人决定去死', '我是山姆', '上帝之城', '英雄本色', '头号玩家', '谍影重重3', '岁月神偷', '疯狂原始人', '纵横四海', '三块广告牌', '达拉斯买家俱乐部', '卢旺达饭店', '未麻的部屋', '心迷宫', '花样年华', '记忆碎片', '模仿游戏', '黑客帝国3：矩阵革命', '你的名字。', '荒蛮故事', '新世界', '忠犬八公物语', '萤火虫之墓', '爆裂鼓手', '贫民窟的百万富翁', '东邪西毒', '真爱至上', '头脑特工队', '黑天鹅', '海街日记', '惊魂记', '你看起来好像很好吃', '无敌破坏王', '冰川时代', '雨人', '恋恋笔记本', '小偷家族', '绿里奇迹', '爱在午夜降临前', '疯狂的石头', '恐怖游轮', '奇迹男孩', '二十二', '海边的曼彻斯特', '雨中曲', '魔女宅急便', '房间', '虎口脱险', '人工智能', '哈利·波特与火焰杯', '罗生门', '可可西里', '终结者2：审判日', '2001太空漫游', '初恋这件小事', '城市之光', '色，戒', '九品芝麻官', '魂断蓝桥', '牯岭街少年杀人事件', '海洋', '遗愿清单', '寄生虫', '新龙门客栈', '燃情岁月', '源代码', '大佛普拉斯', '青蛇', '无耻混蛋', '穿越时空的少女', '波西米亚狂想曲', '血钻', '疯狂的麦克斯4：狂暴之路', '阿飞正传', '步履不停', '谍影重重2', '完美陌生人', '地球上的星星', '战争之王', '彗星来的那一夜', '香水', '谍影重重', '朗读者', '东京物语', '猜火车', '再次出发之纽约遇见你', '浪潮', '千钧一发', '驴得水', '聚焦', '小萝莉的猴神大叔', '黑客帝国2：重装上阵', '我爱你', '追随', '无间道2', '东京教父', '黑鹰坠落', '一次别离', '网络谜踪']

    for i in range(len(list)):
        print('序号%s.%s' % (i + 1, list[i]))
        with open('电影排行.txt','a+',encoding='utf-8') as f:
            f.write('序号%s.%s' % (i + 1, list[i])+'\n')
            s = f.readlines()
            print(s)





